RoboMagus/ESP32-MQTT-Bluetooth-Monitor/src/BluetoothScanner.cpp
// Basic headers
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include <array>
#include <vector>
#include <utility>
#include <algorithm>

// IDF headers
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <driver/gpio.h>
#include "nvs.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "esp_log.h"
#include "esp32-hal-bt.h"
#include "esp_bt.h"
#include "esp_bt_main.h"
#include "esp_bt_device.h"
#include "esp_gap_bt_api.h"

#include <Arduino.h>
#include <ezTime.h>

// Tweaked SDK configuration
#include "sdkconfig.h"

#include "BluetoothScanner.h"
#include "parameter.h"
#include "mqtt.h"
#include "led.h"

#include "CallbackHelper.h"


#define GAP_TAG          "GAP"
#define SPP_TAG          "SPP"
#define GATTC_TAG        "GATTC"

#define GAP_CALLBACK_SIGNATURE void(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param)

extern Parameter mqtt_identity;
extern Parameter mqtt_topic;

extern Parameter bluetooth_monitor_arrival_scans;
extern Parameter bluetooth_monitor_departure_scans;
extern Parameter bluetooth_monitor_seconds_between_scan_iters;
extern Parameter bluetooth_monitor_beacon_expiration;
extern Parameter bluetooth_monitor_min_time_between_scans;
extern Parameter bluetooth_monitor_periodic_scan_interval;

#define REMOVE_PARAM_PAIRS
#ifndef REMOVE_PARAM_PAIRS
extern Parameter bluetooth_monitor_MAC1;
extern Parameter bluetooth_monitor_MAC1_alias;
extern Parameter bluetooth_monitor_MAC2;
extern Parameter bluetooth_monitor_MAC2_alias;
extern Parameter bluetooth_monitor_MAC3;
extern Parameter bluetooth_monitor_MAC3_alias;
extern Parameter bluetooth_monitor_MAC4;
extern Parameter bluetooth_monitor_MAC4_alias;
extern Parameter bluetooth_monitor_MAC5;
extern Parameter bluetooth_monitor_MAC5_alias;
extern Parameter bluetooth_monitor_MAC6;
extern Parameter bluetooth_monitor_MAC6_alias;
extern Parameter bluetooth_monitor_MAC7;
extern Parameter bluetooth_monitor_MAC7_alias;
extern Parameter bluetooth_monitor_MAC8;
extern Parameter bluetooth_monitor_MAC8_alias;
#endif
extern Timezone mTime;


#ifndef REMOVE_PARAM_PAIRS
std::vector<std::pair<Parameter&, Parameter&>> paramPairs = {
    {bluetooth_monitor_MAC1, bluetooth_monitor_MAC1_alias},
    {bluetooth_monitor_MAC2, bluetooth_monitor_MAC2_alias},
    {bluetooth_monitor_MAC3, bluetooth_monitor_MAC3_alias},
    {bluetooth_monitor_MAC4, bluetooth_monitor_MAC4_alias},
    {bluetooth_monitor_MAC5, bluetooth_monitor_MAC5_alias},
    {bluetooth_monitor_MAC6, bluetooth_monitor_MAC6_alias},
    {bluetooth_monitor_MAC7, bluetooth_monitor_MAC7_alias},
    {bluetooth_monitor_MAC8, bluetooth_monitor_MAC8_alias}
};
#endif


#define ENDIAN_CHANGE_U16(x) ((((x)&0xFF00) >> 8) + (((x)&0xFF) << 8))

// =================================================================================
// =================================================================================
//      Free Functions:
// =================================================================================

// -----------------------------------------------
#define BLUETOOTH_MON_VERSION "0.1.000"
String createConfidenceMessage(const char* MAC, uint8_t confidence, const char* name, const char* timestamp, bool retain = false, const char* manufacturer = "Unknown") {
    char buf[320];
    // Wed Jun 09 2021 20:03:45 GMT+0200 (CEST)
    snprintf(buf, 320, "{\"id\":\"%s\",\"confidence\":\"%d\",\"name\":\"%s\",\"manufacturer\":\"%s\",\"type\":\"KNOWN_MAC\",\"retained\":\"%s\",\"timestamp\":\"%s\",\"version\":\"%s\"}", 
        MAC, confidence, name, manufacturer, (retain ? "true" : "false"), timestamp, BLUETOOTH_MON_VERSION);
    return buf;
}

// -----------------------------------------------
char *bda2str(const esp_bd_addr_t bda, char *str, size_t size)
{
    if (bda == NULL || str == NULL || size < 18) {
        return NULL;
    }

    const uint8_t *p = bda;
    sprintf(str, "%02x:%02x:%02x:%02x:%02x:%02x",
            p[0], p[1], p[2], p[3], p[4], p[5]);
    return str;
}

// -----------------------------------------------
bool str2bda(const char* str, esp_bd_addr_t& mac) {
    if(strlen(str) < 12 || strlen(str) > 18) {
        return false;
    }

    uint8_t *p = mac;
    // Scan for MAC with semicolon separators
    int args_found = sscanf(str, "%" SCNx8 ":%" SCNx8 ":%" SCNx8 ":%" SCNx8 ":%" SCNx8 ":%" SCNx8,
            &p[0], &p[1], &p[2], &p[3], &p[4], &p[5]);
    if( args_found == 6 ) {
        return true;
    }

    // Scan for mac without semicolons
    args_found = sscanf(str, "%" SCNx8 "%" SCNx8 "%" SCNx8 "%" SCNx8 "%" SCNx8 "%" SCNx8,
            &p[0], &p[1], &p[2], &p[3], &p[4], &p[5]);
    
    if( args_found == 6 ) {
        return true;
    }

    // Invalid MAC 
    return false;
}

// -----------------------------------------------
static char *uuid2str(esp_bt_uuid_t *uuid, char *str, size_t size)
{
    if (uuid == NULL || str == NULL) {
        return NULL;
    }

    if (uuid->len == 2 && size >= 5) {
        sprintf(str, "%04x", uuid->uuid.uuid16);
    } else if (uuid->len == 4 && size >= 9) {
        sprintf(str, "%08x", uuid->uuid.uuid32);
    } else if (uuid->len == 16 && size >= 37) {
        uint8_t *p = uuid->uuid.uuid128;
        sprintf(str, "%02x%02x%02x%02x-%02x%02x-%02x%02x-%02x%02x-%02x%02x%02x%02x%02x%02x",
                p[15], p[14], p[13], p[12], p[11], p[10], p[9], p[8],
                p[7], p[6], p[5], p[4], p[3], p[2], p[1], p[0]);
    } else {
        return NULL;
    }

    return str;
}

// -----------------------------------------------
static bool get_name_from_eir(uint8_t *eir, uint8_t *bdname, uint8_t *bdname_len)
{
    uint8_t *rmt_bdname = NULL;
    uint8_t rmt_bdname_len = 0;

    if (!eir) {
        return false;
    }

    rmt_bdname = esp_bt_gap_resolve_eir_data(eir, ESP_BT_EIR_TYPE_CMPL_LOCAL_NAME, &rmt_bdname_len);
    if (!rmt_bdname) {
        rmt_bdname = esp_bt_gap_resolve_eir_data(eir, ESP_BT_EIR_TYPE_SHORT_LOCAL_NAME, &rmt_bdname_len);
    }

    if (rmt_bdname) {
        if (rmt_bdname_len > ESP_BT_GAP_MAX_BDNAME_LEN) {
            rmt_bdname_len = ESP_BT_GAP_MAX_BDNAME_LEN;
        }

        if (bdname) {
            memcpy(bdname, rmt_bdname, rmt_bdname_len);
            bdname[rmt_bdname_len] = '\0';
        }
        if (bdname_len) {
            *bdname_len = rmt_bdname_len;
        }
        return true;
    }

