RoboMagus/ESP32-MQTT-Bluetooth-Monitor/src/BluetoothScanner.cpp
    return false;
}

// -----------------------------------------------

void BluetoothScanner::onResult(BLEAdvertisedDevice advertisedDevice) {
    bleAdvertisedDeviceResultQueue.push(advertisedDevice);
}

// -----------------------------------------------
void BluetoothScanner::HandleBleAdvertisementResult(BLEAdvertisedDevice& bleAdvertisedDeviceResult) {
    SCOPED_STACK_ENTRY;
    if (bleAdvertisedDeviceResult.haveName())
    {
    // telnetSerial.print("Device name: ");
    // telnetSerial.println(advertisedDevice.getName().c_str());
    // telnetSerial.println("");
    }

    if (bleAdvertisedDeviceResult.haveServiceUUID())
    {
    // BLEUUID devUUID = advertisedDevice.getServiceUUID();
    // telnetSerial.print("Found ServiceUUID: ");
    // telnetSerial.println(devUUID.toString().c_str());
    // telnetSerial.println("");
    }
    else
    {
        if (bleAdvertisedDeviceResult.haveManufacturerData() == true)
        {
            std::string strManufacturerData = bleAdvertisedDeviceResult.getManufacturerData();

            uint8_t cManufacturerData[100];
            strManufacturerData.copy((char *)cManufacturerData, strManufacturerData.length(), 0);

            if (strManufacturerData.length() == 25 && cManufacturerData[0] == 0x4C && cManufacturerData[1] == 0x00)
            {
            telnetSerial.println("Found an iBeacon!");
            String rssi_s = "??";
            if(bleAdvertisedDeviceResult.haveRSSI()) {
                rssi_s = bleAdvertisedDeviceResult.getRSSI();
            }
            BLEBeacon oBeacon = BLEBeacon();
            oBeacon.setData(strManufacturerData);
            telnetSerial.printf("iBeacon Frame\n");
            telnetSerial.printf("ID: %04X Major: %d Minor: %d UUID: %s Power: %d, RSSI: %s\n", oBeacon.getManufacturerId(), ENDIAN_CHANGE_U16(oBeacon.getMajor()), ENDIAN_CHANGE_U16(oBeacon.getMinor()), oBeacon.getProximityUUID().toString().c_str(), oBeacon.getSignalPower(), rssi_s.c_str());
            }
            else
            { /*
            telnetSerial.println("Found another manufacturers beacon!");
            telnetSerial.printf("strManufacturerData: %d ", strManufacturerData.length());
            for (int i = 0; i < strManufacturerData.length(); i++)
            {
                telnetSerial.printf("[%X]", cManufacturerData[i]);
            }
            telnetSerial.printf("\n");
            */
            }
        }
        return;
    }

    uint8_t *payLoad = bleAdvertisedDeviceResult.getPayload();

    BLEUUID checkUrlUUID = (uint16_t)0xfeaa;

    if (bleAdvertisedDeviceResult.getServiceUUID().equals(checkUrlUUID))
    {
        if (payLoad[11] == 0x10)
        {
            telnetSerial.println("Found an EddystoneURL beacon!");
            BLEEddystoneURL foundEddyURL = BLEEddystoneURL();
            std::string eddyContent((char *)&payLoad[11]); // incomplete EddystoneURL struct!

            foundEddyURL.setData(eddyContent);
            std::string bareURL = foundEddyURL.getURL();
            if (bareURL[0] == 0x00)
            {
            size_t payLoadLen = bleAdvertisedDeviceResult.getPayloadLength();
            telnetSerial.println("DATA-->");
            for (int idx = 0; idx < payLoadLen; idx++)
            {
                telnetSerial.printf("0x%08X ", payLoad[idx]);
            }
            telnetSerial.println("\nInvalid Data");
            return;
            }

            telnetSerial.printf("Found URL: %s\n", foundEddyURL.getURL().c_str());
            telnetSerial.printf("Decoded URL: %s\n", foundEddyURL.getDecodedURL().c_str());
            telnetSerial.printf("TX power %d\n", foundEddyURL.getPower());
            telnetSerial.println("\n");
        }
        else if (payLoad[11] == 0x20)
        {
            telnetSerial.println("Found an EddystoneTLM beacon!");
            BLEEddystoneTLM foundEddyURL = BLEEddystoneTLM();
            std::string eddyContent((char *)&payLoad[11]); // incomplete EddystoneURL struct!

            eddyContent = "01234567890123";

            for (int idx = 0; idx < 14; idx++)
            {
            eddyContent[idx] = payLoad[idx + 11];
            }

            foundEddyURL.setData(eddyContent);
            telnetSerial.printf("Reported battery voltage: %dmV\n", foundEddyURL.getVolt());
            telnetSerial.printf("Reported temperature from TLM class: %.2fC\n", (double)foundEddyURL.getTemp());
            int temp = (int)payLoad[16] + (int)(payLoad[15] << 8);
            float calcTemp = temp / 256.0f;
            telnetSerial.printf("Reported temperature from data: %.2fC\n", calcTemp);
            telnetSerial.printf("Reported advertise count: %d\n", foundEddyURL.getCount());
            telnetSerial.printf("Reported time since last reboot: %ds\n", foundEddyURL.getTime());
            telnetSerial.println("\n");
            telnetSerial.print(foundEddyURL.toString().c_str());
            telnetSerial.println("\n");
        }
    }
}






// =================================================================================
// =================================================================================
//      Class Functions:
// =================================================================================

// -----------------------------------------------
void BluetoothScanner::loadSettings() {
    num_arrival_scans         = atoi(bluetooth_monitor_arrival_scans.getValue());
    num_departure_scans       = atoi(bluetooth_monitor_departure_scans.getValue());
    scan_iter_interval        = strtoul(bluetooth_monitor_seconds_between_scan_iters.getValue(), NULL, 0);
    beacon_expiration_seconds = strtoul(bluetooth_monitor_beacon_expiration.getValue(), NULL, 0);
    min_seconds_between_scans = strtoul(bluetooth_monitor_min_time_between_scans.getValue(), NULL, 0);
    periodic_scan_interval    = strtoul(bluetooth_monitor_periodic_scan_interval.getValue(), NULL, 0);

    scanner_identity = mqtt_identity.getValue();

    telnetSerial.printf("BT Scanner settings:\n  num_arrival_scans: %d\n  num_departure_scans: %d\n  scan_iter_interval: %lu\n  beacon_expiration_seconds: %d\n  min_seconds_between_scans: %d\n  periodic_scan_interval: %d\n  scanner_identity: %s\n\n",
        num_arrival_scans, num_departure_scans, scan_iter_interval, beacon_expiration_seconds, min_seconds_between_scans, periodic_scan_interval, scanner_identity);
}

// -----------------------------------------------
void BluetoothScanner::loadKnownBluetoothDevices() {
#ifndef REMOVE_PARAM_PAIRS
    std::lock_guard<std::mutex> lock(btDevicesMutex);
    for(auto pair : paramPairs) {
        esp_bd_addr_t mac;
        if(str2bda(pair.first.getValue(), mac)) {
            btDevices.emplace_back(mac, String(pair.second.getValue()));
            telnetSerial.printf("Added BT device with MAC: %s, Alias: %s\n", mac, pair.second.getValue());
        }
        else {
            telnetSerial.printf("Not added MAC: %s, Alias: %s\n", mac, pair.second.getValue());
        }
    }
#endif
}

// -----------------------------------------------
void BluetoothScanner::printKnownBluetoothPairs() {
    loadKnownBluetoothDevices();

    std::lock_guard<std::mutex> lock(btDevicesMutex);
    char bda_str[18];
    for(auto& dev : btDevices) {
        bda2str(dev.mac, bda_str, 18);
        telnetSerial.printf("MAC: %s, Alias: %s\n", bda_str, dev.name.c_str());
    }
} 


// -----------------------------------------------
void BluetoothScanner::update_device_info(esp_bt_gap_cb_param_t *param)
{
    char bda_str[18];
    uint32_t cod = 0;
    int32_t rssi = -129; /* invalid value */
    esp_bt_gap_dev_prop_t *p;

    ESP_LOGI(GAP_TAG, "Device found: %s", bda2str(param->disc_res.bda, bda_str, 18));
    for (int i = 0; i < param->disc_res.num_prop; i++) {
        p = param->disc_res.prop + i;
        switch (p->type) {
        case ESP_BT_GAP_DEV_PROP_COD:
            cod = *(uint32_t *)(p->val);
            ESP_LOGI(GAP_TAG, "--Class of Device: 0x%x", cod);
            break;
        case ESP_BT_GAP_DEV_PROP_RSSI:
            rssi = *(int8_t *)(p->val);
            ESP_LOGI(GAP_TAG, "--RSSI: %d", rssi);
            break;
        case ESP_BT_GAP_DEV_PROP_BDNAME:
        default:
            break;
        }
    }

    /* search for device with MAJOR service class as "rendering" in COD */
    app_gap_cb_t *p_dev = &m_dev_info;
    if (p_dev->dev_found && 0 != memcmp(param->disc_res.bda, p_dev->bda, ESP_BD_ADDR_LEN)) {
        return;
    }

    if (!esp_bt_gap_is_valid_cod(cod) ||
            !(esp_bt_gap_get_cod_major_dev(cod) == ESP_BT_COD_MAJOR_DEV_PHONE)) {
        return;
    }

